docs: Changed architecture diagram to mermaid
